PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f86j65.inc
;----- EFLOCON Bits -----------------------------------------------------
FCEN0            EQU  H'0000'
FCEN1            EQU  H'0001'
FULDPXS          EQU  H'0002'


;----- MACON1 Bits -----------------------------------------------------
MARXEN           EQU  H'0000'
PASSALL          EQU  H'0001'
RXPAUS           EQU  H'0002'
TXPAUS           EQU  H'0003'


;----- MACON3 Bits -----------------------------------------------------
FULDPX           EQU  H'0000'
FRMLNEN          EQU  H'0001'
HFRMEN           EQU  H'0002'
PHDREN           EQU  H'0003'
TXCRCEN          EQU  H'0004'
PADCFG0          EQU  H'0005'
PADCFG1          EQU  H'0006'
PADCFG2          EQU  H'0007'



;----- MACON4 Bits -----------------------------------------------------
DEFER            EQU  H'0006'


;----- MABBIPG Bits -----------------------------------------------------
BBIPG0           EQU  H'0000'
BBIPG1           EQU  H'0001'
BBIPG2           EQU  H'0002'
BBIPG3           EQU  H'0003'
BBIPG4           EQU  H'0004'
BBIPG5           EQU  H'0005'
BBIPG6           EQU  H'0006'


;----- MICMD Bits -----------------------------------------------------
MIIRD            EQU  H'0000'
MIISCAN          EQU  H'0001'


;----- ERXFCON Bits -----------------------------------------------------
BCEN             EQU  H'0000'
MCEN             EQU  H'0001'
HTEN             EQU  H'0002'
MPEN             EQU  H'0003'
PMEN             EQU  H'0004'
CRCEN            EQU  H'0005'
ANDOR            EQU  H'0006'
UCEN             EQU  H'0007'


;----- EIE Bits -----------------------------------------------------
RXERIE           EQU  H'0000'
TXERIE           EQU  H'0001'
TXIE_EIE         EQU  H'0003'
LINKIE           EQU  H'0004'
DMAIE            EQU  H'0005'
PKTIE            EQU  H'0006'

ETXIE            EQU  H'0003'


;----- ESTAT Bits -----------------------------------------------------
PHYRDY           EQU  H'0000'
TXABRT           EQU  H'0001'
RXBUSY           EQU  H'0002'
BUFER            EQU  H'0006'


;----- ECON2 Bits -----------------------------------------------------
ETHEN            EQU  H'0005'
PKTDEC           EQU  H'0006'
AUTOINC          EQU  H'0007'


;----- EIR Bits -----------------------------------------------------
RXERIF           EQU  H'0000'
TXERIF           EQU  H'0001'
TXIF_EIR         EQU  H'0003'
LINKIF           EQU  H'0004'
DMAIF            EQU  H'0005'
PKTIF            EQU  H'0006'


;----- EDATA Bits -----------------------------------------------------
EDATA0           EQU  H'0000'
EDATA1           EQU  H'0001'
EDATA2           EQU  H'0002'
EDATA3           EQU  H'0003'
EDATA4           EQU  H'0004'
EDATA5           EQU  H'0005'
EDATA6           EQU  H'0006'
EDATA7           EQU  H'0007'


;----- ECCP2DEL Bits -----------------------------------------------------
PRSEN            EQU  H'0007'

PDC0             EQU  H'0000'
PDC1             EQU  H'0001'
PDC2             EQU  H'0002'
PDC3             EQU  H'0003'
PDC4             EQU  H'0004'
PDC5             EQU  H'0005'
PDC6             EQU  H'0006'

P2DC0            EQU  H'0000'
P2DC1            EQU  H'0001'
P2DC2            EQU  H'0002'
P2DC3            EQU  H'0003'
P2DC4            EQU  H'0004'
P2DC5            EQU  H'0005'
P2DC6            EQU  H'0006'
P2RSEN           EQU  H'0007'


;----- ECCP2AS Bits -----------------------------------------------------
ECCPASE          EQU  H'0007'

PSSBD0           EQU  H'0000'
PSSBD1           EQU  H'0001'
PSSAC0           EQU  H'0002'
PSSAC1           EQU  H'0003'
ECCPAS0          EQU  H'0004'
ECCPAS1          EQU  H'0005'
ECCPAS2          EQU  H'0006'

PSS2BD0          EQU  H'0000'
PSS2BD1          EQU  H'0001'
PSS2AC0          EQU  H'0002'
PSS2AC1          EQU  H'0003'
ECCP2AS0         EQU  H'0004'
ECCP2AS1         EQU  H'0005'
ECCP2AS2         EQU  H'0006'
ECCP2ASE         EQU  H'0007'


;----- ECCP3DEL Bits -----------------------------------------------------
PRSEN            EQU  H'0007'

PDC0             EQU  H'0000'
PDC1             EQU  H'0001'
PDC2             EQU  H'0002'
PDC3             EQU  H'0003'
PDC4             EQU  H'0004'
PDC5             EQU  H'0005'
PDC6             EQU  H'0006'

P3DC0            EQU  H'0000'
P3DC1            EQU  H'0001'
P3DC2            EQU  H'0002'
P3DC3            EQU  H'0003'
P3DC4            EQU  H'0004'
P3DC5            EQU  H'0005'
P3DC6            EQU  H'0006'
P3RSEN           EQU  H'0007'


;----- ECCP3AS Bits -----------------------------------------------------
ECCPASE          EQU  H'0007'

PSSBD0           EQU  H'0000'
PSSBD1           EQU  H'0001'
PSSAC0           EQU  H'0002'
PSSAC1           EQU  H'0003'
ECCPAS0          EQU  H'0004'
ECCPAS1          EQU  H'0005'
ECCPAS2          EQU  H'0006'

PSS3BD0          EQU  H'0000'
PSS3BD1          EQU  H'0001'
PSS3AC0          EQU  H'0002'
PSS3AC1          EQU  H'0003'
ECCP3AS0         EQU  H'0004'
ECCP3AS1         EQU  H'0005'
ECCP3AS2         EQU  H'0006'
ECCP3ASE         EQU  H'0007'


;----- RCSTA2 Bits -----------------------------------------------------
RX9D             EQU  H'0000'
OERR             EQU  H'0001'
FERR             EQU  H'0002'
ADDEN            EQU  H'0003'
CREN             EQU  H'0004'
SREN             EQU  H'0005'
RX9              EQU  H'0006'
SPEN             EQU  H'0007'

RCD8             EQU  H'0000'
RC9              EQU  H'0006'

NOT_RC8          EQU  H'0006'

RC8_9            EQU  H'0006'

RX9D2            EQU  H'0000'
OERR2            EQU  H'0001'
FERR2            EQU  H'0002'
ADDEN2           EQU  H'0003'
CREN2            EQU  H'0004'
SREN2            EQU  H'0005'
RX92             EQU  H'0006'
SPEN2            EQU  H'0007'


;----- TXSTA2 Bits -----------------------------------------------------
TX9D             EQU  H'0000'
TRMT             EQU  H'0001'
BRGH             EQU  H'0002'
SENDB            EQU  H'0003'
SYNC             EQU  H'0004'
TXEN             EQU  H'0005'
TX9              EQU  H'0006'
CSRC             EQU  H'0007'

TXD8             EQU  H'0000'
TX8_9            EQU  H'0006'

NOT_TX8          EQU  H'0006'

TX9D2            EQU  H'0000'
TRMT2            EQU  H'0001'
BRGH2            EQU  H'0002'
SENDB2           EQU  H'0003'
SYNC2            EQU  H'0004'
TXEN2            EQU  H'0005'
TX92             EQU  H'0006'
CSRC2            EQU  H'0007'


